In [2]:
#pandas :- is a library written in python for data manipulation and analysis.in particular it offers data structure and
#operation for manipulating numerical tables and time series.it is build upon numpy

In [3]:
#import pandas package
import pandas as pd

In [4]:
#pandas provide two major data structure
#a)Series:- is 1-dimension labelled homogeneous array
#b)DataFrame :- 2-D labelled array (tabular form) with heterogeneous columns

In [9]:
#create Series :- can be made from list,tuple,numpy array,dictionary,scaler value
s=pd.Series()#default type is float64

In [8]:
s

Series([], dtype: float64)

In [10]:
s=pd.Series([1,2,3,4,5,6,7])

In [12]:
s#here value is labelled means every element has index

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int64

In [18]:
s=pd.Series(("ravi","sourav","himanshu","kiran","amit"))#store homogeneous value and string is object

In [14]:
s

0        ravi
1      sourav
2    himanshu
3       kiran
4        amit
dtype: object

In [16]:
s=pd.Series([1,True,"hello"])

In [17]:
s

0        1
1     True
2    hello
dtype: object

In [19]:
#from dictionary
s=pd.Series({"college":"sit","name":"ravi","branch":"cse"})

In [21]:
s#here keys  of dictionary will be labell

college     sit
name       ravi
branch      cse
dtype: object

In [22]:
import numpy as np
s=pd.Series(np.random.randint(2,8,(20)))

In [23]:
s

0     2
1     2
2     7
3     5
4     6
5     2
6     3
7     4
8     5
9     6
10    5
11    7
12    4
13    4
14    7
15    5
16    7
17    7
18    3
19    3
dtype: int32

In [24]:
type(s)

pandas.core.series.Series

In [25]:
s=pd.Series(["2017-01-01","2018-0101","2019-01-01"])

In [26]:
s

0    2017-01-01
1     2018-0101
2    2019-01-01
dtype: object

In [45]:
s=pd.Series(["2017-01-01","2018-0101","2019-01-01"],dtype=np.datetime64["ns"])

TypeError: 'type' object is not subscriptable

In [29]:
s=pd.Series(34)

In [30]:
s

0    34
dtype: int64

In [32]:
s=pd.Series(34,index=[101,200,405])

In [33]:
s

101    34
200    34
405    34
dtype: int64

In [34]:
s=pd.Series(["a","b","c","d"],
           index=['first','second','third','fourth'])

In [35]:
s

first     a
second    b
third     c
fourth    d
dtype: object

In [36]:
s.size

4

In [38]:
s.dtype#object

dtype('O')

In [39]:
s.ndim

1

In [40]:
s.itemsize

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Series.itemsize is deprecated and will be removed in a future version
  """Entry point for launching an IPython kernel.

8

In [41]:
s.shape

(4,)

In [46]:
#accessing series value

In [53]:
#slice operatr :like numpy array

In [48]:
s=pd.Series(np.random.randint(1,100,(5)))

In [49]:
s

0    24
1    38
2    26
3    97
4    50
dtype: int32

In [50]:
s[0]

24

In [52]:
s[-1]#will not work

KeyError: -1

In [54]:
s

0    24
1    38
2    26
3    97
4    50
dtype: int32

In [55]:
s[2:]

2    26
3    97
4    50
dtype: int32

In [57]:
s[:2]

0    24
1    38
dtype: int32

In [59]:
s[::-1]#reverse series

4    50
3    97
2    26
1    38
0    24
dtype: int32

In [60]:
s[::]

0    24
1    38
2    26
3    97
4    50
dtype: int32

In [62]:
s[[True,False,False,True,True]]

0    24
3    97
4    50
dtype: int32

In [63]:
s=pd.Series({"name":"ravi","age":23,"branch":"cse"})

In [64]:
s["name"]

'ravi'

In [65]:
s

name      ravi
age         23
branch     cse
dtype: object

In [66]:
s["branch"]

'cse'

In [69]:
s["branch"]

'cse'

In [76]:
#label list indexing
s[["name","age"]]

name    sourav
age         23
dtype: object

In [71]:
s["name"]="sourav"

In [72]:
s

name      sourav
age           23
branch       cse
dtype: object

In [75]:
s["college"]:"dit"
#if label is their then it will updat and if label is not their then it will create a new label

In [74]:
s

name      sourav
age           23
branch       cse
dtype: object

In [77]:
#basic function

In [78]:
s=pd.Series(np.random.randint(1,100,(20)))

In [79]:
s

0     52
1     86
2     64
3     31
4     58
5     95
6     65
7     87
8     52
9     85
10    58
11     7
12    17
13    87
14    36
15    93
16    50
17    16
18    64
19    91
dtype: int32

In [81]:
#show top 5 values

s.head()

0    52
1    86
2    64
3    31
4    58
dtype: int32

In [82]:
#bottom 5 values
s.tail()

15    93
16    50
17    16
18    64
19    91
dtype: int32

In [83]:
s.head(8)
#we can tell how many values we want

0    52
1    86
2    64
3    31
4    58
5    95
6    65
7    87
dtype: int32

In [84]:
s.tail(8)

12    17
13    87
14    36
15    93
16    50
17    16
18    64
19    91
dtype: int32

In [85]:
s.values

array([52, 86, 64, 31, 58, 95, 65, 87, 52, 85, 58,  7, 17, 87, 36, 93, 50,
       16, 64, 91])

In [86]:
s.index

RangeIndex(start=0, stop=20, step=1)

In [87]:
s=pd.Series(['a','b','c'],index=[100,200,300])

In [88]:
s

100    a
200    b
300    c
dtype: object

In [89]:
s.index=[1,2,3]

In [90]:
s

1    a
2    b
3    c
dtype: object

In [91]:
s=pd.Series(np.arange(10))

In [92]:
s

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int32

In [93]:
s.describe()

count    10.00000
mean      4.50000
std       3.02765
min       0.00000
25%       2.25000
50%       4.50000
75%       6.75000
max       9.00000
dtype: float64

In [94]:
s=pd.Series(["sourav","amit","manish","mukesh"])

In [95]:
s

0    sourav
1      amit
2    manish
3    mukesh
dtype: object

In [96]:
s.describe()

count          4
unique         4
top       manish
freq           1
dtype: object

In [97]:
#2nd data structure
#DataFrame--list,tuple,dictionary,series, numpy array, scalar

In [98]:
s=pd.DataFrame()

In [100]:
s
#empty dataframe

Empty DataFrame
Columns: []
Index: []

In [101]:
s=pd.DataFrame([1,2,3,4])

In [102]:
s

   0
0  1
1  2
2  3
3  4

In [103]:
s=pd.DataFrame([["ravi",23],["mohit",23],["mukesh",20]])

In [104]:
s

        0   1
0    ravi  23
1   mohit  23
2  mukesh  20

In [106]:
s=pd.DataFrame([{"name":"Ravi","age":34},{"name":"mau","age":24},{"name":"Rahul","age":44}])

In [107]:
s

   age   name
0   34   Ravi
1   24    mau
2   44  Rahul

In [110]:
s=pd.DataFrame(np.arange(6).reshape(2,3),index=['a','b'],columns=["x","y","x"])

In [111]:
s

   x  y  x
a  0  1  2
b  3  4  5

In [112]:
s=pd.DataFrame(np.arange(6).reshape(2,3),index=['a','b'],columns=["x","y","x"],dtype=np.float)

In [113]:
s

     x    y    x
a  0.0  1.0  2.0
b  3.0  4.0  5.0

In [114]:
s.index

Index(['a', 'b'], dtype='object')

In [115]:
s.columns

Index(['x', 'y', 'x'], dtype='object')

In [117]:
s.describe()

             x        y        x
count  2.00000  2.00000  2.00000
mean   1.50000  2.50000  3.50000
std    2.12132  2.12132  2.12132
min    0.00000  1.00000  2.00000
25%    0.75000  1.75000  2.75000
50%    1.50000  2.50000  3.50000
75%    2.25000  3.25000  4.25000
max    3.00000  4.00000  5.00000

In [118]:
s

     x    y    x
a  0.0  1.0  2.0
b  3.0  4.0  5.0

In [119]:
s.info

<bound method DataFrame.info of      x    y    x
a  0.0  1.0  2.0
b  3.0  4.0  5.0>

In [120]:
s

     x    y    x
a  0.0  1.0  2.0
b  3.0  4.0  5.0

In [121]:
s.head()

     x    y    x
a  0.0  1.0  2.0
b  3.0  4.0  5.0

In [122]:
s.tail()

     x    y    x
a  0.0  1.0  2.0
b  3.0  4.0  5.0

In [123]:
s.tail(1)

     x    y    x
b  3.0  4.0  5.0

In [124]:
s.values

array([[0., 1., 2.],
       [3., 4., 5.]])

In [158]:
#read value from different data sources
'''a)from csv
b)from excel
c)from html
d)from sqlquery
e)from table
f)from json
g)from xml
h)from clipboard
i)from feather
'''

'a)from csv\nb)from excel\nc)from html\nd)from sqlquery\ne)from table\nf)from json\ng)from xml\nh)from clipboard\ni)from feather\n'

In [138]:
#df=pd.read_csv("sample.csv")
df=pd.read_csv("a.csv")
df

     name  marks  year
0  mukesh     34  2000
1    negi     24  1000

In [141]:
#df=pd.read_excel("sample.xlsx")
df=pd.read_excel("a.xlsx")
df

    rahul  23    kali
0  mukesh  21  ubuntu
1     jai  20  window

In [142]:
#df=pd.read_json("sample.json")
df=pd.read_json("a.json")
df

   age branch   name
0   23    cse   anuj
1   23     me   anil
2   23     me  karan

In [144]:
#df=pd.read_table("sample.table")
df=pd.read_table("a.txt",sep="&")
df

     name  age  marks
0  mukesh   21     34
1   rahul   34     35
2   dhaka   43     44

In [145]:
#df=pd.read_clipboard()
df=pd.read_clipboard()
df

Empty DataFrame
Columns: [dhaka&43&44]
Index: []

In [148]:
#df=pd.read_sql("sql,con")
import sqlite3
con=sqlite3.connect("student.db")
df=pd.read_sql("select * from student",con)
df

   id    name
0   2   kiran
1   3   mohit
2   4  keshav
3   5  manish

In [150]:
#df=pd.read_pickle("sample.pickle")
df=pd.read_pickle("product.pickle")
df

[{'company': 'lenovo', 'price': 10532},
 {'company': 'lenovo', 'price': 10532},
 {'company': 'lenovo', 'price': 10532}]

In [155]:
#df=pd.read_html("url")
df=pd.read_html("https://www.w3schools.com/sql/sql_syntax.asp")
df

[            0                                   1                   2  \
 0  CustomerID                        CustomerName         ContactName
 1           1                 Alfreds Futterkiste        Maria Anders
 2           2  Ana Trujillo Emparedados y helados        Ana Trujillo
 3           3             Antonio Moreno Taquera      Antonio Moreno
 4           4                     Around the Horn        Thomas Hardy
 5           5                  Berglunds snabbkp  Christina Berglund

                                3            4           5        6
 0                        Address         City  PostalCode  Country
 1                  Obere Str. 57       Berlin       12209  Germany
 2  Avda. de la Constitucin 2222  Mxico D.F.       05021   Mexico
 3                 Mataderos 2312  Mxico D.F.       05023   Mexico
 4                120 Hanover Sq.       London     WA1 1DP       UK
 5                 Berguvsvgen 8        Lule    S-958 22   Sweden  ]

In [157]:
df[1]

IndexError: list index out of range